/*
Author: Gudakov Ramil Sergeevich a.k.a. Gauss 
Гудаков Рамиль Сергеевич 
Contacts: [ramil2085@mail.ru, ramil2085@gmail.com]
See for more information License.h.
*/

#ifndef ParadigmaH
#define ParadigmaH

/*
  1. Дублирование данных и кода - зло.
  2. Мультизадачность для программиста - зло.
  3. Если пишешь код для других программистов, то пиши кроссплатформенный.
  4. Код должен быть по возможности общим. Формализовать группу классов, искать общие черты и свойства.
  Лучше написать и исправить 5%, а не 100%. Это своего рода архивация.
*/

#endif
